]{
 "intents":[
     {"tag": "greeting",
         "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day"],
         "responses": ["Hello, thanks for visiting", "Good to see you again", "Hi there, how can I help?"],
         "context_set": ""
      },
      {"tag": "goodbye",
       "patterns": ["Bye", "See you later", "Goodbye"],
       "responses": ["See you later, thanks ", "Have a nice day", "Bye! Come back again soon."]
      },
      {"tag": "thanks",
       "patterns": ["Thanks", "Thank you", "That's helpful"],
       "responses": ["Happy to help!", "Any time!", "My pleasure", "you're welcome"]
      }, 
     {"tag": "Choice",
       "patterns": ["What can i pursue?", "Career choices", "career options", "what am i qualified for?"],
       "responses": ["There are various career subjects, they include STEM, Social Sciences, Arts and Sports Science. Please input the preferred for more details"]    
     },
     {"tag":"Careers",
      "patterns": ["Science ,Engineering, Technology and Mathematics", "Arts and sports science"],
      "response" : ["Are good at Math, Technology and sciences?"," Are you good at arts, sports and physical education and life skills" ]
     },
     {"tag": "yes",
       "patterns": ["yes"],
       "responses": ["please input your grades to determine if you are qualified. Math, computer science, intergrated science, health sciences, language"]
     },
     {
      "tag": "STEM",
      "patterns": [
      "A - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, A - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "A - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, A - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, A - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, A - INTERGRATED SCIENCE, B - HEALTH SCIENCES, B - LANGUAGE",
      "B - MATHEMATICS, B - COMPUTER SCIENCE, B - INTERGRATED SCIENCE, A - HEALTH SCIENCES, B - LANGUAGE"                                                                                              
      ],
      
      "responses": [
      "You qualify to take STEM"
      ]
      },
      {
      "tag": "ARTS AND SPORTS SCIENCE",
      "patterns": [
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS,  A- LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATIONS,A -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, B - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "A - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, A -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, A - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, A - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, A - LIFE SKILLS, B - ARTS, B - LANGUAGE",
      "B - SPORTS AND PHYSICAL EDUCATION, B -  VISUAL ARTS, B - LIFE SKILLS, A - ARTS, B - LANGUAGE"                                                                                              
      ],
      
      "responses": [
      "You qualify to take ARTS AND SPORTS SCIENCE"
      ]
      }
      ]}